module Examples exposing (..)


intro : String
intro =
    """nonzero ::= 1|2|3|4|5|6|7|8|9
digit ::= 0|1|2|3|4|5|6|7|8|9
two-digit ::= <nonzero><digit>

consonant ::= b|c|d|f|g|k|l|m|n|p|r|s|t|v
vowel ::= a|o|i|u|e
pair ::= <consonant><vowel>
name ::= <pair><pair><consonant>

hello ::= hi | hello | hey

intro ::= <hello>, my name is <name> and I'm <two-digit> years old.
"""


rumors : String
rumors =
    """
ראשי ::=
\t<חזיתי> ש<שמועה> |
\t<חזיתי> ש<שמועה> |
\t<חזיתי> ש<שמועה> |
\t<חזיתי> ש<שמועה> |
\t<חזיתי> ש<שמועה> |
\t<חזיתי> ש<שמועה> |
\tלא תאמין מה <חזיתי-במקום-ספציפי> הרגע ב<מקום>! <שמועה> |
\tלא תאמין מה <חזיתי-במקום-ספציפי> הרגע ב<מקום>! <שמועה> |
\tלא תאמין מה <חזיתי-במקום-ספציפי> הרגע ב<מקום>! <שמועה> |
\tלא תאמין מה <חזיתי-במקום-ספציפי> הרגע ב<מקום>! <שמועה> |
\tלא תאמין מה <חזיתי-במקום-ספציפי> הרגע ב<מקום>! <שמועה> |
\tהייתי עכשיו <איפשהו> ו<חזיתי-במקום-ספציפי> ש<שמועה> |
\tהייתי עכשיו <איפשהו> ו<חזיתי-במקום-ספציפי> ש<שמועה> |
\tהייתי עכשיו <איפשהו> ו<חזיתי-במקום-ספציפי> ש<שמועה> |
\tהייתי עכשיו <איפשהו> ו<חזיתי-במקום-ספציפי> ש<שמועה> |
\tחזרתי עכשיו <מאיפשהו> ו<חזיתי-במקום-ספציפי> ש<שמועה> |
\tחזרתי עכשיו <מאיפשהו> ו<חזיתי-במקום-ספציפי> ש<שמועה> |
\tחזרתי עכשיו <מאיפשהו> ו<חזיתי-במקום-ספציפי> ש<שמועה> |
\tחזרתי עכשיו <מאיפשהו> ו<חזיתי-במקום-ספציפי> ש<שמועה> |
\tהלכתי לי לתומי ברחוב כשלפתע פגשתי את <שם-של-גבר> והוא אמר לי ש<שמועה> |
\tהלכתי לי לתומי ברחוב כשלפתע פגשתי את <שם-של-אישה> והיא אמרה לי ש<שמועה> |
\tפגשתי עכשיו את <שם-של-גבר> והוא סיפר לי ש<שמועה> |
\tפגשתי עכשיו את <שם-של-אישה> והיא סיפרה לי ש<שמועה>

חזיתי ::= <חזיתי-במקום-ספציפי> | <חזיתי-כללי>
חזיתי-במקום-ספציפי ::= <שם-של-אישה> סיפרה לי | <שם-של-גבר> סיפר לי | שמעתי
חזיתי-כללי ::= ראיתי ב<רשת-חברתית> | עברתי על הפיד שלי ב<רשת-חברתית> וראיתי | קראתי במקומון | קראתי ב<רשת-חברתית> | שמעתי


רשת-חברתית ::= פייסבוק | טוויטר | אינסטגרם | סנאפצ׳ט הזה שלכם | מרשתת | מנוע החיפוש בינג

איפשהו ::= ב<מקום> | ב<מקום> | אצל <שם-של-אישה> | אצל <שם-של-גבר>
מאיפשהו ::= מה<מקום> | מה<מקום> | מ<שם-של-אישה> | מ<שם-של-גבר>
מקום ::= מכולת | סופר | מספרה | בית כנסת | כיכר העיר

שם-של-אישה ::= אירנה | סבטה | סבטלנה | אוקטברינה | מאשה | קרינה | ליזה | אלה | ילנה | רוזה | ז׳ניה | ג׳ניה | יוליה | רוזה | יפעת | מירי | מיכל | גלי | מעיין | מעין עם י׳ אחת
שם-של-גבר ::= יוסי | חיים | ישראל | מיכאל | אלכסיי | אלכס | סשה | דניאל | אליעזר | יונתן | אמיר | תמיר | רועי


שמועה ::=
\t<אנשים-עכשיו-ביחד> |
\t<אנשים-התחתנו> |
\t<מישהו-התקבל-לעבודה>

אנשים-עכשיו-ביחד ::= <זוג-כלשהו> ביחד

אנשים-התחתנו ::=
\t<אישה-כלשהי> התחתנה עם <אישה-כלשהי> |
\t<אישה-כלשהי> התחתנה עם <גבר-כלשהו> |
\t<גבר-כלשהו> התחתן עם <אישה-כלשהי> |
\t<גבר-כלשהו> התחתן עם <גבר-כלשהו>

מישהו-התקבל-לעבודה ::=
\t<גבר-כלשהו> התקבל לעבודה ב<חברה-כלשהי> |
\t<אישה-כלשהי> התקבלה לעבודה ב<חברה-כלשהי>

חברה-כלשהי ::= מייקרוסופט | מלנוקס | אפלייד מטיריאלס | אינטל | נייס | גוגל | וייז | פייסבוק

זוג-כלשהו ::= <גבר-כלשהו> ו<גבר-כלשהו> | <אישה-כלשהי> ו<גבר-כלשהו> | <גבר-כלשהו> ו<אישה-כלשהי> | <אישה-כלשהי> ו<אישה-כלשהי>

גבר-כלשהו ::=
\t<קרוב-רחוק-של-גבר> של <שם-של-גבר> |
\t<קרוב-רחוק-של-אישה> של <שם-של-אישה> |
\t<שם-של-גבר> שלמד איתך ביסודי

אישה-כלשהי ::=
\t<קרובה-רחוקה-של-גבר> של <שם-של-גבר> |
\t<קרובה-רחוקה-של-אישה> של <שם-של-אישה> |
\t<שם-של-אישה> שלמדה איתך ביסודי |
\t<שם-של-אישה> שלמדה איתך ביסודי ואז עברה לגור בפתח תקווה כי ההורים שלה התגרשו אחרי שאמא שלה גילתה שאבא שלה שוכב עם המזכירה של ראש המחלקה שלה

קרוב-רחוק-של-גבר ::= <קרוב-מיודע-לגבר> | <קרוב-מיודע-לגבר> של <קרוב-רחוק-של-גבר> | <קרוב-מיודע-לאישה> של <קרובה-רחוקה-של-גבר>
קרובה-רחוקה-של-גבר ::= <קרובה-מיודעת-לגבר> | <קרובה-מיודעת-לגבר> של <קרוב-רחוק-של-גבר> | <קרובה-מיודעת-לאישה> של <קרובה-רחוקה-של-גבר>
קרוב-רחוק-של-אישה ::= <קרוב-מיודע-לאישה> | <קרוב-מיודע-לאישה> של <קרוב-רחוק-של-אישה> | <קרוב-מיודע-לאישה> של <קרובה-רחוקה-של-אישה>
קרובה-רחוקה-של-אישה ::= <קרובה-מיודעת-לאישה> | <קרובה-מיודעת-לאישה> של <קרוב-רחוק-של-אישה> | <קרובה-מיודעת-לאישה> של <קרובה-רחוקה-של-אישה>


קרובה-מיודעת-לגבר ::= אמא | האמא | אחות | אחותו | האחות | חברה | החברה | בת הזוג | דודה | הדודה | בת הדודה | בת דודה  | הבת | אחיינית | האחיינית | סבתא | הסבתא | הכלה | אשתו | ארוסתו | הארוסה
קרוב-מיודע-לגבר ::= אבא | האבא | אח | אחיו | האח | חבר | החבר | בן הזוג | דוד | הדוד | בן הדוד | בן דוד | הבן | אחיין | האחיין | סבא | הסבא | החתן | בעלו | ארוסו | הארוס
קרובה-מיודעת-לאישה ::= אמא | האמא | אחות | אחותה | האחות | חברה | החברה | בת הזוג | דודה | הדודה | בת הדודה | בת דודה | הבת | אחיינית | האחיינית | סבתא | הסבתא | הכלה | אשתה | ארוסתה | הארוסה
קרוב-מיודע-לאישה ::= אבא | האבא | אח | אחיה | האח | חבר | החבר | בן הזוג | דוד | הדוד | בן הדוד | בן דוד | הבן | אחיין | האחיין | סבא | הסבא | החתן | בעלה | ארוסה | הארוס
"""
